#### Import Packages

In [16]:
import pandas as pd
import numpy as np

In [17]:
# Dataframe 2: RampStaff
df2 = pd.read_excel('SATS_RampSQ_FlightAndDeployment_1stSept_30Nov.xlsx', sheet_name='Sheet1')

In [18]:
display(df2.head())

  Flight Date Orientation  Flight  ST    ET  RLO   RSM  EO   AA
0  2022-09-01   Departure  SQ 225   5  21.0   1.0    3   1  2.0
1  2022-09-01   Departure  SQ 608  10  11.0   1.0    3   0  2.0
2  2022-09-01     Arrival  SQ 208  15  21.0   1.0    4   1  2.0
3  2022-09-01   Departure  SQ 336  15  21.0   1.0    3   1  2.0
4  2022-09-01     Arrival  SQ 242  20  40.0   1.0    3   1  1.0

In [19]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20219 entries, 0 to 20218
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Flight Date  20219 non-null  datetime64[ns]
 1   Orientation  20219 non-null  object
 2   Flight       20219 non-null  object
 3   ST           20219 non-null  int64
 4   ET           20181 non-null  float64
 5   RLO          20205 non-null  float64
 6   RSM          20219 non-null  int64
 7   EO           20219 non-null  int64
 8   AA           20205 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(2)
memory usage: 1.4+ MB

In [20]:
df2.min()

Flight Date    2022-09-01 00:00:00
Orientation                Arrival
Flight                        SQ 1
ST                               5
ET                             0.0
RLO                            0.0
RSM                              0
EO                               0
AA                             0.0
dtype: object

#### All Correlation

In [21]:
df2.corr()

            ST        ET      RLO        RSM        EO        AA
ST    1.000000  0.905790 -0.013402 -0.147964  0.078971 -0.156077
ET    0.905790  1.000000 -0.015364 -0.165384  0.078829 -0.165347
RLO  -0.013402 -0.015364  1.000000  0.255586  0.084003  0.116744
RSM  -0.147964 -0.165384  0.255586  1.000000 -0.198596  0.445978
EO    0.078971  0.078829  0.084003 -0.198596  1.000000 -0.142308
AA   -0.156077 -0.165347  0.116744  0.445978 -0.142308  1.000000

#### Remove spaces in column names

In [22]:
# Remove space in column names
df2.columns = df2.columns.str.replace(' ', '')

In [23]:
df2.columns

Index(['FlightDate', 'Orientation', 'Flight', 'ST', 'ET', 'RLO', 'RSM', 'EO',
       'AA'],
      dtype='object')

#### Remove unnecessary text in Flight

In [24]:
# Flight Number must be string
df2['Flight'] = df2['Flight'].astype(str)
# remove special characters in Flight Number
df2['Flight'] = df2['Flight'].str.replace('[^0-9a-zA-Z]+', '')
df2.head()

C:\Users\cvalley\AppData\Local\Temp\ipykernel_3676\1954086800.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  df2['Flight'] = df2['Flight'].str.replace('[^0-9a-zA-Z]+', '')

  FlightDate Orientation Flight  ST    ET  RLO  RSM  EO   AA
0 2022-09-01   Departure  SQ225   5  21.0  1.0    3   1  2.0
1 2022-09-01   Departure  SQ608  10  11.0  1.0    3   0  2.0
2 2022-09-01     Arrival  SQ208  15  21.0  1.0    4   1  2.0
3 2022-09-01   Departure  SQ336  15  21.0  1.0    3   1  2.0
4 2022-09-01     Arrival  SQ242  20  40.0  1.0    3   1  1.0

#### Check if there's any null values

In [25]:
# Check if there are any null values in the columns ['RLO', 'RSM', 'EO', 'AA']
df2[['RLO', 'RSM', 'EO', 'AA']].isnull().sum()

RLO    14
RSM     0
EO      0
AA     14
dtype: int64

#### Mean and Median for imputation

In [26]:
# find the mean and median of RLO and AA columns
df2[['RLO', 'AA']].describe()

                RLO            AA
count  20205.000000  20205.000000
mean       0.997773      1.712051
std        0.090889      0.587971
min        0.000000      0.000000
25%        1.000000      1.000000
50%        1.000000      2.000000
75%        1.000000      2.000000
max        3.000000      6.000000

In [27]:
# median of RLO and AA columns
df2[['RLO', 'AA']].median()

RLO    1.0
AA     2.0
dtype: float64

#### Fill null values with mean

In [28]:
# Fill null values with mean in the columns ['RLO', 'RSM', 'EO', 'AA']
df2[['RLO','AA']] = df2[['RLO','AA']].fillna(df2[['RLO', 'AA']].mean())
df2[['RLO', 'RSM', 'EO', 'AA']].isnull().sum()

RLO    0
RSM    0
EO     0
AA     0
dtype: int64

#### Add Ramp Staff

In [29]:
# Sum ['RLO'	'RSM'	'EO'	'AA'] columns in df2
df2['Total_Staff'] = df2[['RLO', 'RSM', 'EO', 'AA']].sum(axis=1)
df2 = df2.drop(['RLO', 'RSM', 'EO', 'AA'], axis=1)
df2

      FlightDate Orientation Flight    ST      ET  Total_Staff
0     2022-09-01   Departure  SQ225     5    21.0          7.0
1     2022-09-01   Departure  SQ608    10    11.0          6.0
2     2022-09-01     Arrival  SQ208    15    21.0          8.0
3     2022-09-01   Departure  SQ336    15    21.0          7.0
4     2022-09-01     Arrival  SQ242    20    40.0          6.0
...          ...         ...    ...   ...     ...          ...
20214 2022-11-30   Departure  SQ378  2345     2.0          7.0
20215 2022-11-30   Departure   SQ26  2355   114.0          7.0
20216 2022-11-30   Departure  SQ324  2355    54.0          5.0
20217 2022-11-30   Departure  SQ638  2355    40.0          6.0
20218 2022-11-30     Arrival  SQ897  2355  2338.0          4.0

[20219 rows x 6 columns]

#### Checking values

In [30]:
# Show Flight=SQ208 and where 'Total Staff' column is 8
df2[(df2['Flight'] == 'SQ208') & (df2['Total_Staff'] == 8)]

     FlightDate Orientation Flight  ST    ET  Total_Staff
2    2022-09-01     Arrival  SQ208  15  21.0          8.0
663  2022-09-04     Arrival  SQ208  15  32.0          8.0
9895 2022-10-17     Arrival  SQ208  15  45.0          8.0

In [31]:
df2.columns

Index(['FlightDate', 'Orientation', 'Flight', 'ST', 'ET', 'Total_Staff'], dtype='object')

#### Specific Flight

In [32]:
df2[df2['Flight'] == 'SQ208'].head()

    FlightDate Orientation Flight  ST    ET  Total_Staff
2   2022-09-01     Arrival  SQ208  15  21.0          8.0
215 2022-09-02     Arrival  SQ208  15  34.0          6.0
437 2022-09-03     Arrival  SQ208  15  11.0          6.0
663 2022-09-04     Arrival  SQ208  15  32.0          8.0
892 2022-09-05     Arrival  SQ208  15  43.0          5.0

#### Remove departure in orientation

In [33]:
# Remove departure in orientation column
df2 = df2[df2['Orientation'] != 'Departure']
df2.head()

   FlightDate Orientation Flight   ST     ET  Total_Staff
2  2022-09-01     Arrival  SQ208   15   21.0          8.0
4  2022-09-01     Arrival  SQ242   20   40.0          6.0
11 2022-09-01     Arrival   SQ11  115   38.0          7.0
22 2022-09-01     Arrival   TR25  355  355.0          6.0
23 2022-09-01     Arrival  TR509  405  510.0          7.0

In [34]:
df2[df2['Orientation']=='Departure'].head()

Empty DataFrame
Columns: [FlightDate, Orientation, Flight, ST, ET, Total_Staff]
Index: []

#### Info and drop duplicates

In [35]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10113 entries, 2 to 20218
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   FlightDate   10113 non-null  datetime64[ns]
 1   Orientation  10113 non-null  object
 2   Flight       10113 non-null  object
 3   ST           10113 non-null  int64
 4   ET           10085 non-null  float64
 5   Total_Staff  10113 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 553.1+ KB

In [36]:
# Drop duplicates
df2 = df2.drop_duplicates()
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10113 entries, 2 to 20218
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   FlightDate   10113 non-null  datetime64[ns]
 1   Orientation  10113 non-null  object
 2   Flight       10113 non-null  object
 3   ST           10113 non-null  int64
 4   ET           10085 non-null  float64
 5   Total_Staff  10113 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 553.1+ KB

#### Dataframe to CSV

In [37]:
# Dataframe to csv
df2.to_csv('Processed_data/RampStaff.csv', index=False)